(function webpackUniversalModuleDefinition(root, factory) {
	if(typeof exports === 'object' && typeof module === 'object')
		module.exports = factory();
	else if(typeof define === 'function' && define.amd)
		define([], factory);
	else if(typeof exports === 'object')
		exports["WynVisualClass"] = factory();
	else
		root["WynVisualClass"] = factory();
})(window, function() {
return /******/ (function(modules) { // webpackBootstrap
/******/ 	// The module cache
/******/ 	var installedModules = {};
/******/
/******/ 	// The require function
/******/ 	function __webpack_require__(moduleId) {
/******/
/******/ 		// Check if module is in cache
/******/ 		if(installedModules[moduleId]) {
/******/ 			return installedModules[moduleId].exports;
/******/ 		}
/******/ 		// Create a new module (and put it into the cache)
/******/ 		var module = installedModules[moduleId] = {
/******/ 			i: moduleId,
/******/ 			l: false,
/******/ 			exports: {}
/******/ 		};
/******/
/******/ 		// Execute the module function
/******/ 		modules[moduleId].call(module.exports, module, module.exports, __webpack_require__);
/******/
/******/ 		// Flag the module as loaded
/******/ 		module.l = true;
/******/
/******/ 		// Return the exports of the module
/******/ 		return module.exports;
/******/ 	}
/******/
/******/
/******/ 	// expose the modules object (__webpack_modules__)
/******/ 	__webpack_require__.m = modules;
/******/
/******/ 	// expose the module cache
/******/ 	__webpack_require__.c = installedModules;
/******/
/******/ 	// define getter function for harmony exports
/******/ 	__webpack_require__.d = function(exports, name, getter) {
/******/ 		if(!__webpack_require__.o(exports, name)) {
/******/ 			Object.defineProperty(exports, name, { enumerable: true, get: getter });
/******/ 		}
/******/ 	};
/******/
/******/ 	// define __esModule on exports
/******/ 	__webpack_require__.r = function(exports) {
/******/ 		if(typeof Symbol !== 'undefined' && Symbol.toStringTag) {
/******/ 			Object.defineProperty(exports, Symbol.toStringTag, { value: 'Module' });
/******/ 		}
/******/ 		Object.defineProperty(exports, '__esModule', { value: true });
/******/ 	};
/******/
/******/ 	// create a fake namespace object
/******/ 	// mode & 1: value is a module id, require it
/******/ 	// mode & 2: merge all properties of value into the ns
/******/ 	// mode & 4: return value when already ns object
/******/ 	// mode & 8|1: behave like require
/******/ 	__webpack_require__.t = function(value, mode) {
/******/ 		if(mode & 1) value = __webpack_require__(value);
/******/ 		if(mode & 8) return value;
/******/ 		if((mode & 4) && typeof value === 'object' && value && value.__esModule) return value;
/******/ 		var ns = Object.create(null);
/******/ 		__webpack_require__.r(ns);
/******/ 		Object.defineProperty(ns, 'default', { enumerable: true, value: value });
/******/ 		if(mode & 2 && typeof value != 'string') for(var key in value) __webpack_require__.d(ns, key, function(key) { return value[key]; }.bind(null, key));
/******/ 		return ns;
/******/ 	};
/******/
/******/ 	// getDefaultExport function for compatibility with non-harmony modules
/******/ 	__webpack_require__.n = function(module) {
/******/ 		var getter = module && module.__esModule ?
/******/ 			function getDefault() { return module['default']; } :
/******/ 			function getModuleExports() { return module; };
/******/ 		__webpack_require__.d(getter, 'a', getter);
/******/ 		return getter;
/******/ 	};
/******/
/******/ 	// Object.prototype.hasOwnProperty.call
/******/ 	__webpack_require__.o = function(object, property) { return Object.prototype.hasOwnProperty.call(object, property); };
/******/
/******/ 	// __webpack_public_path__
/******/ 	__webpack_require__.p = "";
/******/
/******/
/******/ 	// Load entry module and return exports
/******/ 	return __webpack_require__(__webpack_require__.s = "./src/visual.ts");
/******/ })
/************************************************************************/
/******/ ({

/***/ "./src/cityID.json":
/*!*************************!*\
  !*** ./src/cityID.json ***!
  \*************************/
/*! exports provided: 北京, 海淀, 朝阳, 昌平, 房山, 通州, 丰台, 大兴, 延庆, 平谷, 天津, 南开, 武清, 滨海新区, 宝坻, 蓟州, 津南, 东丽, 红桥, 北辰, 石家庄, 邯郸, 张家口, 唐山, 廊坊, 邢台, 沧州, 衡水, 承德, 保定, 太原, 运城, 忻州, 临汾, 长治, 大同, 晋中, 吕梁, 南郊, 阳泉, 赤峰, 通辽, 呼和浩特, 包头, 锡林郭勒, 呼伦贝尔, 鄂尔多斯, 乌兰察布, 兴安盟, 巴彦淖尔, 沈阳, 大连, 锦州, 鞍山, 营口, 葫芦岛, 瓦房店, 海城, 本溪, 长春, 四平, 吉林, 榆树, 农安, 公主岭, 松原, 通化, 延边, 辽源, 哈尔滨, 绥化, 齐齐哈尔, 伊春, 佳木斯, 黑河, 双鸭山, 牡丹江, 鹤岗, 肇东, 上海, 浦东新区, 松江, 嘉定, 宝山, 青浦, 闵行, 奉贤, 徐汇, 杨浦, 南京, 扬州, 盐城, 泰州, 宿迁, 苏州, 徐州, 常州, 京口, 镇江, 杭州, 宁波, 绍兴, 温州, 金华, 嘉兴, 台州, 舟山, 湖州, 临海, 合肥, 滁州, 亳州, 蚌埠, 安庆, 宿州, 阜阳, 六安, 颍上, 利辛, 福州, 泉州, 漳州, 厦门, 崇武, 惠安, 晋江, 南平, 莆田, 龙岩, 南昌, 宜春, 赣州, 抚州, 九江, 上饶, 吉安, 景德镇, 鄱阳, 萍乡, 济南, 莱芜, 泰安, 临沂, 济宁, 枣庄, 烟台, 青岛, 德州, 潍坊, 郑州, 许昌, 南阳, 焦作, 周口, 驻马店, 洛阳, 濮阳, 信阳, 平顶山, 武汉, 孝感, 荆州, 十堰, 襄阳, 黄冈, 宜昌, 黄石, 钟祥, 鄂州, 长沙, 益阳, 郴州, 永州, 怀化, 娄底, 衡阳, 常德, 岳阳, 邵阳, 广州, 肇庆, 湛江, 清远, 东莞, 茂名, 清城, 揭阳, 惠州, 梅州, 南宁, 玉林, 桂林, 贵港, 钦州, 河池, 百色, 柳州, 桂平, 来宾, 海口, 儋州, 屯昌, 琼山, 三亚, 东方, 临高, 文昌, 定安, 琼海, 重庆, 合川, 涪陵, 云阳, 永川, 九龙坡, 江津, 万州, 开州, 渝北, 成都, 巴中, 广安, 内江, 乐山, 德阳, 泸州, 绵阳, 遂宁, 资阳, 贵阳, 遵义, 毕节, 铜仁, 黔南, 黔东南, 安顺, 盘州, 威宁, 云岩, 昆明, 大理, 红河, 曲靖, 文山, 昭通, 临沧, 镇雄, 保山, 会泽, 拉萨, 日喀则, 那曲, 昌都, 山南, 城关, 林芝, 江达, 卡若, 阿里, 西安, 汉中, 渭南, 咸阳, 榆林, 宝鸡, 安康, 长安, 延安, 商洛, 兰州, 天水, 庆阳, 白银, 定西, 武威, 张掖, 平凉, 酒泉, 西宁, 海东, 湟中, 乐都, 民和, 城北, 海西, 互助, 城中, 海北, 银川, 吴忠, 中卫, 固原, 青铜峡, 海原, 西吉, 同心, 陶乐, 灵武, 乌鲁木齐, 塔城, 阿克苏, 和田, 昌吉, 巴音郭楞, 伊犁, 英吉沙, 巴楚, 疏附, 马公市, 台北, 台中, 彰化, 台南, 桃园, 高雄, 嘉义, 南投, 花莲, 香港, 新界, 九龙, 澳门, 氹仔岛, 路环岛, default */
/***/ (function(module) {

eval("module.exports = JSON.parse(\"{\\\"北京\\\":\\\"CN101010100\\\",\\\"海淀\\\":\\\"CN101010200\\\",\\\"朝阳\\\":\\\"CN101071201\\\",\\\"昌平\\\":\\\"CN101010700\\\",\\\"房山\\\":\\\"CN101011200\\\",\\\"通州\\\":\\\"CN101010600\\\",\\\"丰台\\\":\\\"CN101010900\\\",\\\"大兴\\\":\\\"CN101011100\\\",\\\"延庆\\\":\\\"CN101010800\\\",\\\"平谷\\\":\\\"CN101011500\\\",\\\"天津\\\":\\\"CN101030100\\\",\\\"南开\\\":\\\"CN101031500\\\",\\\"武清\\\":\\\"CN101030200\\\",\\\"滨海新区\\\":\\\"CN101031100\\\",\\\"宝坻\\\":\\\"CN101030300\\\",\\\"蓟州\\\":\\\"CN101031400\\\",\\\"津南\\\":\\\"CN101031000\\\",\\\"东丽\\\":\\\"CN101030400\\\",\\\"红桥\\\":\\\"CN101031700\\\",\\\"北辰\\\":\\\"CN101030600\\\",\\\"石家庄\\\":\\\"CN101090101\\\",\\\"邯郸\\\":\\\"CN101091001\\\",\\\"张家口\\\":\\\"CN101090301\\\",\\\"唐山\\\":\\\"CN101090501\\\",\\\"廊坊\\\":\\\"CN101090601\\\",\\\"邢台\\\":\\\"CN101090901\\\",\\\"沧州\\\":\\\"CN101090701\\\",\\\"衡水\\\":\\\"CN101090801\\\",\\\"承德\\\":\\\"CN101090402\\\",\\\"保定\\\":\\\"CN101090201\\\",\\\"太原\\\":\\\"CN101100101\\\",\\\"运城\\\":\\\"CN101100801\\\",\\\"忻州\\\":\\\"CN101101001\\\",\\\"临汾\\\":\\\"CN101100701\\\",\\\"长治\\\":\\\"CN101100501\\\",\\\"大同\\\":\\\"CN101100201\\\",\\\"晋中\\\":\\\"CN101100401\\\",\\\"吕梁\\\":\\\"CN101101100\\\",\\\"南郊\\\":\\\"CN101100210\\\",\\\"阳泉\\\":\\\"CN101100301\\\",\\\"赤峰\\\":\\\"CN101080601\\\",\\\"通辽\\\":\\\"CN101080501\\\",\\\"呼和浩特\\\":\\\"CN101080101\\\",\\\"包头\\\":\\\"CN101080201\\\",\\\"锡林郭勒\\\":\\\"CN101080902\\\",\\\"呼伦贝尔\\\":\\\"CN101081013\\\",\\\"鄂尔多斯\\\":\\\"CN101080701\\\",\\\"乌兰察布\\\":\\\"CN101080405\\\",\\\"兴安盟\\\":\\\"CN101081108\\\",\\\"巴彦淖尔\\\":\\\"CN101080811\\\",\\\"沈阳\\\":\\\"CN101070101\\\",\\\"大连\\\":\\\"CN101070201\\\",\\\"锦州\\\":\\\"CN101070701\\\",\\\"鞍山\\\":\\\"CN101070301\\\",\\\"营口\\\":\\\"CN101070801\\\",\\\"葫芦岛\\\":\\\"CN101071401\\\",\\\"瓦房店\\\":\\\"CN101070202\\\",\\\"海城\\\":\\\"CN101070304\\\",\\\"本溪\\\":\\\"CN101070501\\\",\\\"长春\\\":\\\"CN101060101\\\",\\\"四平\\\":\\\"CN101060401\\\",\\\"吉林\\\":\\\"CN101060201\\\",\\\"榆树\\\":\\\"CN101060105\\\",\\\"农安\\\":\\\"CN101060102\\\",\\\"公主岭\\\":\\\"CN101060404\\\",\\\"松原\\\":\\\"CN101060801\\\",\\\"通化\\\":\\\"CN101060501\\\",\\\"延边\\\":\\\"CN101060306\\\",\\\"辽源\\\":\\\"CN101060701\\\",\\\"哈尔滨\\\":\\\"CN101050101\\\",\\\"绥化\\\":\\\"CN101050501\\\",\\\"齐齐哈尔\\\":\\\"CN101050201\\\",\\\"伊春\\\":\\\"CN101050801\\\",\\\"佳木斯\\\":\\\"CN101050401\\\",\\\"黑河\\\":\\\"CN101050601\\\",\\\"双鸭山\\\":\\\"CN101051301\\\",\\\"牡丹江\\\":\\\"CN101050301\\\",\\\"鹤岗\\\":\\\"CN101051201\\\",\\\"肇东\\\":\\\"CN101050502\\\",\\\"上海\\\":\\\"CN101020100\\\",\\\"浦东新区\\\":\\\"CN101020600\\\",\\\"松江\\\":\\\"CN101020900\\\",\\\"嘉定\\\":\\\"CN101020500\\\",\\\"宝山\\\":\\\"CN101020300\\\",\\\"青浦\\\":\\\"CN101020800\\\",\\\"闵行\\\":\\\"CN101020200\\\",\\\"奉贤\\\":\\\"CN101021000\\\",\\\"徐汇\\\":\\\"CN101021200\\\",\\\"杨浦\\\":\\\"CN101021700\\\",\\\"南京\\\":\\\"CN101190101\\\",\\\"扬州\\\":\\\"CN101190601\\\",\\\"盐城\\\":\\\"CN101190701\\\",\\\"泰州\\\":\\\"CN101191201\\\",\\\"宿迁\\\":\\\"CN101191301\\\",\\\"苏州\\\":\\\"CN101190401\\\",\\\"徐州\\\":\\\"CN101190801\\\",\\\"常州\\\":\\\"CN101191101\\\",\\\"京口\\\":\\\"CN101190306\\\",\\\"镇江\\\":\\\"CN101190301\\\",\\\"杭州\\\":\\\"CN101210101\\\",\\\"宁波\\\":\\\"CN101210401\\\",\\\"绍兴\\\":\\\"CN101210507\\\",\\\"温州\\\":\\\"CN101210701\\\",\\\"金华\\\":\\\"CN101210901\\\",\\\"嘉兴\\\":\\\"CN101210301\\\",\\\"台州\\\":\\\"CN101210601\\\",\\\"舟山\\\":\\\"CN101211101\\\",\\\"湖州\\\":\\\"CN101210201\\\",\\\"临海\\\":\\\"CN101210610\\\",\\\"合肥\\\":\\\"CN101220101\\\",\\\"滁州\\\":\\\"CN101221101\\\",\\\"亳州\\\":\\\"CN101220901\\\",\\\"蚌埠\\\":\\\"CN101220201\\\",\\\"安庆\\\":\\\"CN101220601\\\",\\\"宿州\\\":\\\"CN101220701\\\",\\\"阜阳\\\":\\\"CN101220801\\\",\\\"六安\\\":\\\"CN101221501\\\",\\\"颍上\\\":\\\"CN101220803\\\",\\\"利辛\\\":\\\"CN101220903\\\",\\\"福州\\\":\\\"CN101230101\\\",\\\"泉州\\\":\\\"CN101230501\\\",\\\"漳州\\\":\\\"CN101230601\\\",\\\"厦门\\\":\\\"CN101230201\\\",\\\"崇武\\\":\\\"CN101230507\\\",\\\"惠安\\\":\\\"CN101230508\\\",\\\"晋江\\\":\\\"CN101230509\\\",\\\"南平\\\":\\\"CN101230901\\\",\\\"莆田\\\":\\\"CN101230401\\\",\\\"龙岩\\\":\\\"CN101230701\\\",\\\"南昌\\\":\\\"CN101240101\\\",\\\"宜春\\\":\\\"CN101240501\\\",\\\"赣州\\\":\\\"CN101240701\\\",\\\"抚州\\\":\\\"CN101240401\\\",\\\"九江\\\":\\\"CN101240201\\\",\\\"上饶\\\":\\\"CN101240301\\\",\\\"吉安\\\":\\\"CN101240601\\\",\\\"景德镇\\\":\\\"CN101240801\\\",\\\"鄱阳\\\":\\\"CN101240302\\\",\\\"萍乡\\\":\\\"CN101240901\\\",\\\"济南\\\":\\\"CN101120101\\\",\\\"莱芜\\\":\\\"CN101121601\\\",\\\"泰安\\\":\\\"CN101120801\\\",\\\"临沂\\\":\\\"CN101120901\\\",\\\"济宁\\\":\\\"CN101120701\\\",\\\"枣庄\\\":\\\"CN101121401\\\",\\\"烟台\\\":\\\"CN101120501\\\",\\\"青岛\\\":\\\"CN101120201\\\",\\\"德州\\\":\\\"CN101120401\\\",\\\"潍坊\\\":\\\"CN101120601\\\",\\\"郑州\\\":\\\"CN101180101\\\",\\\"许昌\\\":\\\"CN101180401\\\",\\\"南阳\\\":\\\"CN101180701\\\",\\\"焦作\\\":\\\"CN101181101\\\",\\\"周口\\\":\\\"CN101181401\\\",\\\"驻马店\\\":\\\"CN101181601\\\",\\\"洛阳\\\":\\\"CN101180901\\\",\\\"濮阳\\\":\\\"CN101181301\\\",\\\"信阳\\\":\\\"CN101180601\\\",\\\"平顶山\\\":\\\"CN101180501\\\",\\\"武汉\\\":\\\"CN101200101\\\",\\\"孝感\\\":\\\"CN101200401\\\",\\\"荆州\\\":\\\"CN101200801\\\",\\\"十堰\\\":\\\"CN101201101\\\",\\\"襄阳\\\":\\\"CN101200201\\\",\\\"黄冈\\\":\\\"CN101200501\\\",\\\"宜昌\\\":\\\"CN101200901\\\",\\\"黄石\\\":\\\"CN101200601\\\",\\\"钟祥\\\":\\\"CN101201402\\\",\\\"鄂州\\\":\\\"CN101200301\\\",\\\"长沙\\\":\\\"CN101250101\\\",\\\"益阳\\\":\\\"CN101250700\\\",\\\"郴州\\\":\\\"CN101250501\\\",\\\"永州\\\":\\\"CN101251401\\\",\\\"怀化\\\":\\\"CN101251201\\\",\\\"娄底\\\":\\\"CN101250801\\\",\\\"衡阳\\\":\\\"CN101250401\\\",\\\"常德\\\":\\\"CN101250601\\\",\\\"岳阳\\\":\\\"CN101251001\\\",\\\"邵阳\\\":\\\"CN101250901\\\",\\\"广州\\\":\\\"CN101280101\\\",\\\"肇庆\\\":\\\"CN101280901\\\",\\\"湛江\\\":\\\"CN101281001\\\",\\\"清远\\\":\\\"CN101281301\\\",\\\"东莞\\\":\\\"CN101281601\\\",\\\"茂名\\\":\\\"CN101282001\\\",\\\"清城\\\":\\\"CN101281309\\\",\\\"揭阳\\\":\\\"CN101281901\\\",\\\"惠州\\\":\\\"CN101280301\\\",\\\"梅州\\\":\\\"CN101280401\\\",\\\"南宁\\\":\\\"CN101300101\\\",\\\"玉林\\\":\\\"CN101300901\\\",\\\"桂林\\\":\\\"CN101300501\\\",\\\"贵港\\\":\\\"CN101300801\\\",\\\"钦州\\\":\\\"CN101301101\\\",\\\"河池\\\":\\\"CN101301201\\\",\\\"百色\\\":\\\"CN101301001\\\",\\\"柳州\\\":\\\"CN101300301\\\",\\\"桂平\\\":\\\"CN101300802\\\",\\\"来宾\\\":\\\"CN101300401\\\",\\\"海口\\\":\\\"CN101310101\\\",\\\"儋州\\\":\\\"CN101310205\\\",\\\"屯昌\\\":\\\"CN101310210\\\",\\\"琼山\\\":\\\"CN101310104\\\",\\\"三亚\\\":\\\"CN101310201\\\",\\\"东方\\\":\\\"CN101310202\\\",\\\"临高\\\":\\\"CN101310203\\\",\\\"文昌\\\":\\\"CN101310212\\\",\\\"定安\\\":\\\"CN101310209\\\",\\\"琼海\\\":\\\"CN101310211\\\",\\\"重庆\\\":\\\"CN101040100\\\",\\\"合川\\\":\\\"CN101040300\\\",\\\"涪陵\\\":\\\"CN101041400\\\",\\\"云阳\\\":\\\"CN101041700\\\",\\\"永川\\\":\\\"CN101040200\\\",\\\"九龙坡\\\":\\\"CN101043900\\\",\\\"江津\\\":\\\"CN101040500\\\",\\\"万州\\\":\\\"CN101041300\\\",\\\"开州\\\":\\\"CN101044100\\\",\\\"渝北\\\":\\\"CN101040700\\\",\\\"成都\\\":\\\"CN101270101\\\",\\\"巴中\\\":\\\"CN101270901\\\",\\\"广安\\\":\\\"CN101270801\\\",\\\"内江\\\":\\\"CN101271201\\\",\\\"乐山\\\":\\\"CN101271401\\\",\\\"德阳\\\":\\\"CN101272001\\\",\\\"泸州\\\":\\\"CN101271001\\\",\\\"绵阳\\\":\\\"CN101270401\\\",\\\"遂宁\\\":\\\"CN101270701\\\",\\\"资阳\\\":\\\"CN101271301\\\",\\\"贵阳\\\":\\\"CN101260101\\\",\\\"遵义\\\":\\\"CN101260201\\\",\\\"毕节\\\":\\\"CN101260701\\\",\\\"铜仁\\\":\\\"CN101260601\\\",\\\"黔南\\\":\\\"CN101260413\\\",\\\"黔东南\\\":\\\"CN101260506\\\",\\\"安顺\\\":\\\"CN101260301\\\",\\\"盘州\\\":\\\"CN101260804\\\",\\\"威宁\\\":\\\"CN101260704\\\",\\\"云岩\\\":\\\"CN101260110\\\",\\\"昆明\\\":\\\"CN101290101\\\",\\\"大理\\\":\\\"CN101290201\\\",\\\"红河\\\":\\\"CN101290301\\\",\\\"曲靖\\\":\\\"CN101290401\\\",\\\"文山\\\":\\\"CN101290601\\\",\\\"昭通\\\":\\\"CN101291001\\\",\\\"临沧\\\":\\\"CN101291101\\\",\\\"镇雄\\\":\\\"CN101291004\\\",\\\"保山\\\":\\\"CN101290501\\\",\\\"会泽\\\":\\\"CN101290408\\\",\\\"拉萨\\\":\\\"CN101140101\\\",\\\"日喀则\\\":\\\"CN101140201\\\",\\\"那曲\\\":\\\"CN101140601\\\",\\\"昌都\\\":\\\"CN101140501\\\",\\\"山南\\\":\\\"CN101140301\\\",\\\"城关\\\":\\\"CN101160105\\\",\\\"林芝\\\":\\\"CN101140401\\\",\\\"江达\\\":\\\"CN101140509\\\",\\\"卡若\\\":\\\"CN101140512\\\",\\\"阿里\\\":\\\"CN101140701\\\",\\\"西安\\\":\\\"CN101110101\\\",\\\"汉中\\\":\\\"CN101110801\\\",\\\"渭南\\\":\\\"CN101110501\\\",\\\"咸阳\\\":\\\"CN101110200\\\",\\\"榆林\\\":\\\"CN101110401\\\",\\\"宝鸡\\\":\\\"CN101110901\\\",\\\"安康\\\":\\\"CN101110701\\\",\\\"长安\\\":\\\"CN101110102\\\",\\\"延安\\\":\\\"CN101110300\\\",\\\"商洛\\\":\\\"CN101110601\\\",\\\"兰州\\\":\\\"CN101160101\\\",\\\"天水\\\":\\\"CN101160901\\\",\\\"庆阳\\\":\\\"CN101160401\\\",\\\"白银\\\":\\\"CN101161301\\\",\\\"定西\\\":\\\"CN101160201\\\",\\\"武威\\\":\\\"CN101160501\\\",\\\"张掖\\\":\\\"CN101160701\\\",\\\"平凉\\\":\\\"CN101160301\\\",\\\"酒泉\\\":\\\"CN101160801\\\",\\\"西宁\\\":\\\"CN101150101\\\",\\\"海东\\\":\\\"CN101150207\\\",\\\"湟中\\\":\\\"CN101150104\\\",\\\"乐都\\\":\\\"CN101150202\\\",\\\"民和\\\":\\\"CN101150203\\\",\\\"城北\\\":\\\"CN101150108\\\",\\\"海西\\\":\\\"CN101150702\\\",\\\"互助\\\":\\\"CN101150204\\\",\\\"城中\\\":\\\"CN101150106\\\",\\\"海北\\\":\\\"CN101150804\\\",\\\"银川\\\":\\\"CN101170101\\\",\\\"吴忠\\\":\\\"CN101170301\\\",\\\"中卫\\\":\\\"CN101170501\\\",\\\"固原\\\":\\\"CN101170401\\\",\\\"青铜峡\\\":\\\"CN101170306\\\",\\\"海原\\\":\\\"CN101170504\\\",\\\"西吉\\\":\\\"CN101170402\\\",\\\"同心\\\":\\\"CN101170302\\\",\\\"陶乐\\\":\\\"CN101170204\\\",\\\"灵武\\\":\\\"CN101170103\\\",\\\"乌鲁木齐\\\":\\\"CN101130101\\\",\\\"塔城\\\":\\\"CN101131101\\\",\\\"阿克苏\\\":\\\"CN101130801\\\",\\\"和田\\\":\\\"CN101131301\\\",\\\"昌吉\\\":\\\"CN101130401\\\",\\\"巴音郭楞\\\":\\\"CN101130609\\\",\\\"伊犁\\\":\\\"CN101131012\\\",\\\"英吉沙\\\":\\\"CN101130902\\\",\\\"巴楚\\\":\\\"CN101130908\\\",\\\"疏附\\\":\\\"CN101130911\\\",\\\"马公市\\\":\\\"CN753A2\\\",\\\"台北\\\":\\\"CN101340101\\\",\\\"台中\\\":\\\"CN101340401\\\",\\\"彰化\\\":\\\"CN101340403\\\",\\\"台南\\\":\\\"CN101340203\\\",\\\"桃园\\\":\\\"CN101340102\\\",\\\"高雄\\\":\\\"CN101340201\\\",\\\"嘉义\\\":\\\"CN101340202\\\",\\\"南投\\\":\\\"CN101340404\\\",\\\"花莲\\\":\\\"CN101340405\\\",\\\"香港\\\":\\\"CN101320101\\\",\\\"新界\\\":\\\"CN101320103\\\",\\\"九龙\\\":\\\"CN101320102\\\",\\\"澳门\\\":\\\"CN101330101\\\",\\\"氹仔岛\\\":\\\"CN101330102\\\",\\\"路环岛\\\":\\\"CN101330103\\\"}\");\n\n//# sourceURL=webpack://WynVisualClass/./src/cityID.json?");

/***/ }),

/***/ "./src/visual.ts":
/*!***********************!*\
  !*** ./src/visual.ts ***!
  \***********************/
/*! no static exports found */
/***/ (function(module, exports, __webpack_require__) {

"use strict";
eval("\n\nvar __importDefault = this && this.__importDefault || function (mod) {\n  return mod && mod.__esModule ? mod : {\n    \"default\": mod\n  };\n};\n\nexports.__esModule = true;\n\n__webpack_require__(/*! ../style/visual.less */ \"./style/visual.less\");\n\nvar cityID_json_1 = __importDefault(__webpack_require__(/*! ./cityID.json */ \"./src/cityID.json\"));\n\nvar timer = null;\nvar index = 1;\n\nvar Visual =\n/** @class */\nfunction () {\n  function Visual(dom, host) {\n    this.onActionEventHandler = function (name) {\n      console.log(name);\n    };\n\n    this.container = dom;\n    this.visualHost = host;\n    this.cityID = cityID_json_1[\"default\"];\n    this.properties = {};\n    var config = {\n      \"layout\": 1,\n      \"width\": \"450\",\n      \"height\": \"150\",\n      \"background\": 1,\n      \"dataColor\": \"FFFFFF\",\n      \"borderRadius\": 5,\n      \"key\": \"e1b995f9292e4303ab28f145ffb6a95d\"\n    };\n    this.render(config);\n  }\n\n  Visual.prototype.update = function (options) {\n    var _this = this;\n\n    if (options.isFocus || options.isViewer) {\n      this.cityListCode = [];\n      this.properties = options.properties;\n      var config_1 = {\n        \"layout\": 1,\n        \"width\": \"450\",\n        \"height\": \"150\",\n        \"background\": 1,\n        \"dataColor\": \"FFFFFF\",\n        \"borderRadius\": 5,\n        \"key\": \"e1b995f9292e4303ab28f145ffb6a95d\"\n      };\n\n      var autoChangeCity = function () {\n        if (timer) clearInterval(timer);\n        timer = setInterval(function () {\n          config_1[\"city\"] = _this.cityListCode[index];\n\n          _this.render(config_1);\n\n          index++;\n\n          if (index === _this.cityListCode.length) {\n            index = 0;\n          }\n        }, _this.properties.intervalTime * 1000);\n      };\n\n      if (!this.properties.autoCity) {\n        var cityList = this.properties.cityList.split('\\n').map(function (city) {\n          return city.trim();\n        });\n        cityList.forEach(function (city) {\n          if (city !== '' && _this.cityID[\"\" + city]) {\n            _this.cityListCode.push(_this.cityID[\"\" + city]);\n          }\n        });\n\n        if (this.cityListCode.length > 1) {\n          autoChangeCity();\n        } else {\n          config_1[\"city\"] = this.cityListCode[0];\n          if (timer) clearInterval(timer);\n          this.render(config_1);\n        }\n      } else {\n        if (timer) clearInterval(timer);\n        this.render(config_1);\n      }\n    }\n  };\n\n  ;\n\n  Visual.prototype.render = function (config) {\n    this.container.innerHTML = '';\n    var div = document.createElement('div');\n    div.id = \"he-plugin-standard\";\n    var configScript = document.createElement('script');\n    configScript.type = \"text/javascript\";\n    var jsScript = document.createElement('script');\n    jsScript.type = \"text/javascript\";\n    jsScript.src = \"https://widget.heweather.net/standard/static/js/he-standard-common.js?v=1.1\";\n    this.container.appendChild(div);\n    this.container.appendChild(configScript);\n    this.container.appendChild(jsScript);\n    var WIDGET = {\n      CONFIG: config\n    };\n    configScript.innerHTML = \"WIDGET=\" + JSON.stringify(WIDGET);\n  };\n\n  Visual.prototype.getInspectorHiddenState = function (updateOptions) {\n    if (updateOptions.properties.autoCity) {\n      return ['cityList', 'intervalTime'];\n    }\n  }; // 自定义属性可见性\n\n\n  Visual.prototype.getInspectorVisibilityState = function (properties) {\n    return null;\n  }; // 功能按钮可见性\n\n\n  Visual.prototype.getActionBarVisibilityState = function (updateOptions) {\n    return null;\n  };\n\n  return Visual;\n}();\n\nexports[\"default\"] = Visual;\n\n//# sourceURL=webpack://WynVisualClass/./src/visual.ts?");

/***/ }),

/***/ "./style/visual.less":
/*!***************************!*\
  !*** ./style/visual.less ***!
  \***************************/
/*! no static exports found */
/***/ (function(module, exports, __webpack_require__) {

eval("// extracted by mini-css-extract-plugin\n\n//# sourceURL=webpack://WynVisualClass/./style/visual.less?");

/***/ })

/******/ })["default"];
});